app/controllers/api/v1/accounts_controller.rb

SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
---
      def show
        current_user = User.find_by_authentication_token(params[:session_id])
        account = current_user.accounts.find(params[:id])