app/controllers/api/v1/accounts_controller.rb

      def index
        accounts = Account.all
---
SELECT `accounts`.* FROM `accounts`

      def show
        account = Account.find(params[:id])
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1

      def create
        account = Account.new(params_account)
        if account.save
---
INSERT INTO `accounts` (`code`, `name`, `password`, `created_at`, `updated_at`) VALUES ('XYA100', 'Account20', 'Account20', '2020-03-03 10:11:03', '2020-03-03 10:11:03')

      def destroy
        account = Account.find(params[:id])
        account.destroy
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 16 LIMIT 1
DELETE FROM `accounts` WHERE `accounts`.`id` = 16

      def update
        account = Account.find(params[:id])
        if account.update_attributes(params_account)
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
UPDATE `accounts` SET `code` = 'DSA109', `updated_at` = '2020-03-03 12:14:46' WHERE `accounts`.`id` = 17

      def show_media
        account = Account.find(params[:id])
        medias = account.medias.all
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
SELECT `media`.* FROM `media` WHERE `media`.`account_id` = 1

      def show_media_by_code
        account = Account.find_by_code(params[:id])
        medias = account.medias.all
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`code` = 'XYZ100' LIMIT 1
SELECT `media`.* FROM `media` WHERE `media`.`account_id` = 2