app/controllers/api/v1/medias_controller.rb

SELECT `media`.* FROM `media` WHERE (title LIKE '%son%') ORDER BY created_at
SELECT  `media`.* FROM `media` WHERE `media`.`asset_id` = 'AA100' LIMIT 1
SELECT  1 AS one FROM `media` WHERE `media`.`asset_id` = BINARY 'VX100' LIMIT 1
SELECT  `media`.* FROM `media` WHERE (asset_id LIKE '%a%') AND (title LIKE '%SONG%') AND `media`.`duration` BETWEEN 45 AND 100 ORDER BY created_at LIMIT 10 OFFSET 2
---
      def index
        medias = Media.where(nil)
        # search by asset_id
        medias = medias.search_by_asset_id(params[:asset_id]) if
params[:asset_id].present?
        # search by title
        medias = medias.search_by_title(params[:title]) if
params[:title].present?
        # search by duration
        medias = medias.search_by_duration(params[:duration]) if
params[:duration].present?
        # search by duration - from and to
        medias = medias.search_by_duration_from_and_to(params[:from], params[:to]) if params[:from].present? and params[:to].present?
        # sort by created_at
        medias = medias.order('created_at')
        # applying limit and offset
        # limit = 10
        # default offset is 0
        offset = params[:offset] if params[:offset].present?
        medias = medias.offset(offset).limit(10)

INSERT INTO `media` (`asset_id`, `media_type`, `account_id`, `created_at`, `updated_at`) VALUES ('VX100', 'video', 1, '2020-03-03 07:15:03', '2020-03-03 07:15:03')
---
      def create
        media = Media.new(params_media)
        if media.save

SELECT  `media`.* FROM `media` WHERE `media`.`asset_id` = 'Z100' LIMIT 1
---
      def show
        media = Media.find_by_asset_id(params[:id])

SELECT  `media`.* FROM `media` WHERE `media`.`asset_id` = 'Z100' LIMIT 1
DELETE FROM `media` WHERE `media`.`asset_id` = 'A100'
---
      def destroy
        del_media = Media.find_by_asset_id(params[:id])
        del_media.destroy

SELECT  `media`.* FROM `media` WHERE `media`.`asset_id` = 'Z100' LIMIT 1
SELECT  1 AS one FROM `media` WHERE `media`.`asset_id` = 'VA100' LIMIT 1
SELECT `media`.`media_type` FROM `media` WHERE `media`.`asset_id` = 'AA100'
SELECT  `media`.* FROM `media` WHERE `media`.`asset_id` = 'AA100' LIMIT 1
UPDATE `media` SET `duration` = 60, `timecode` = '00:00:00.60', `updated_at` = '2020-03-09 10:49:14' WHERE `media`.`asset_id` = 'AA100'
---
      def update
        saved = []
        unsaved = []
        # CSV.foreach(params[:id], headers: true) do |row|
        CSV.new(open(params[:id]), :headers => :first_row).each do |row|
        #csv_text = File.open(params[:id])
        #csv = CSV.parse(csv_text, :headers => true)
        #csv.each do |row|
          # byebug
          print "\n-----------\n"
          print row
          print "\n-----------\n"
          hash_value = row.to_hash
          if Media.exists? asset_id: hash_value['asset_id']
            type = Media.where(asset_id:
hash_value['asset_id']).pluck(:media_type)[0]
            if type == 'audio'
              hash_value['timecode'] =
Audio.duration_tc(hash_value['duration'].to_i)
            elsif type == 'video'
              hash_value['timecode'] =
Video.duration_tc(hash_value['duration'].to_i)
            end
            metadata = Media.find_by_asset_id(hash_value['asset_id'])
            if metadata.update_attributes(hash_value)