app/controllers/api/v1/medias_controller.rb

SELECT  1 AS one FROM `media` WHERE `media`.`asset_id` = BINARY 'AS100' LIMIT 1
---
      def index
        current_user = User.find_by_authentication_token(params[:session_id])
        if current_user != nil
          medias = Media.where(nil)
          # search by asset_id
          medias = medias.search_by_asset_id(params[:asset_id]) if
  params[:asset_id].present?
          # search by title
          medias = medias.search_by_title(params[:title]) if
  params[:title].present?
          # search by duration
          medias = medias.search_by_duration(params[:duration]) if
  params[:duration].present?
          # search by duration - from and to
          medias = medias.search_by_duration_from_and_to(params[:from], params[:to]) if params[:from].present? and params[:to].present?

SELECT  `media`.* FROM `media` WHERE `media`.`asset_id` = 'Z100' LIMIT 1
---
      def destroy
        current_user = User.find_by_authentication_token(params[:session_id])
        if current_user != nil
          del_media = Media.find_by_asset_id(params[:id])

SELECT  1 AS one FROM `media` WHERE `media`.`asset_id` = BINARY 'AA100' AND `media`.`asset_id` != 'AA100' LIMIT 1
---
      def update
        current_user = User.find_by_authentication_token(params[:session_id])
        if current_user != nil
          saved = []
          access_key_id =  ENV['AWS_ACCESS_KEY_ID']
          secret_access_key = ENV['AWS_SECRET_ACCESS_KEY']
          bucket_name = "prajnarails"
          s3 = Aws::S3::Client.new(region: 'us-east-2', access_key_id: access_key_id, secret_access_key: secret_access_key)
          resp = s3.get_object({
          bucket: bucket_name,
          key: params[:id]
          })
          result = resp.body.read
          csv = CSV.parse(result, :headers => true)
          csv.each do |row|
            asset_id = row[0]
            title = row[1]
            duration = row[2]
            location = row[3]
            recorded_time = row[4]
            if Media.exists? asset_id: asset_id